**Installation**


pip install pandas

**Pandas**

Pandas is a python module that makes data science easy and effective.

pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series

**DataFrame**

Dataframe is a main object in pandas. It is used to represent data with rows and column.

Dataframe is a datastructure represent the data in tabular or excel spread sheet like data

In [0]:
import pandas as pd
df = pd.read_csv('Weather_data_fresh.csv')
df

           day  temperature  windspeed  event      city
0   01-01-2017           32          6   Rain    mumbai
1   02-01-2017           35          7  Sunny  New York
2    03-01-207           28          2   Snow  New York
3   04-01-2017           24          7   Snow  New York
4   05-01-2017           32          4   Rain    mumbai
5   06-01-2017           32          2  Sunny    mumbai
6   07-01-2017           28          6  Sunny    mumbai
7   08-01-2017           24          7   Rain    mumbai
8   09-01-2017           36          2   Snow     paris
9   10-01-2017           38          5  Sunny    mumbai
10  11-01-2017           22          4   Rain  New York
11  12-01-2017           26          2   Rain     paris
12  13-01-2017           24          8  Sunny    mumbai
13  14-01-2017           25          3   Snow     paris
14  15-01-2017           29          6   Rain  New York
15  16-01-2017           30          7   Snow    mumbai
16  17-01-2017           31          5  Sunny     paris
17  18-01-2017           20          2   Snow  New York
18  19-01-2017           25          6  Sunny  New York
19  20-01-2017           28          3   Rain    mumbai
20  21-01-2017           29          4  Sunny     paris
21  22-01-2017           32          5   Snow  New York
22  23-01-2017           21          7   Rain    mumbai
23  24-01-2017           27          5  Sunny     paris

In [0]:
# list of tuple

weather_data = [('1/1/2017', 30, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 32, 2, 'Sunny')
               ]

df = pd.DataFrame(weather_data, columns = ['day', 'temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           30          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

In [0]:
# get dimention of the table

df.shape        # total number of rows and columns

(6, 4)

In [0]:
# if you want to see initial some rows than use head command

df.head()

        day  temperature  windspeed  event
0  1/1/2017           30          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [0]:
# if you want to see initial some rows than use head command

df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

In [0]:
# Slicing

df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [0]:
df.columns  # print columns in a table

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [0]:
df.day # print particular column data

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [0]:
# Anathor way of accessing column

df['day']   # d.day(both are same)

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [0]:
# get 2 or more columns

df[['day', 'event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [0]:
# get all temperature
df['temperature']

0    30
1    35
2    28
3    24
4    32
5    32
Name: temperature, dtype: int64

In [0]:
#print max temperature
df['temperature'].max()

35

In [0]:
#print min temperature
df['temperature'].min()

24

In [0]:
# print max temperature
df['temperature'].describe()

count     6.000000
mean     30.166667
std       3.816630
min      24.000000
25%      28.500000
50%      31.000000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [0]:
# select rows which has maximum temperature
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [0]:
# select only one day column which has maximum temperature
df.day[df.temperature == df.temperature.max()]

1    1/2/2017
Name: day, dtype: object

**Whether Dataset**


Questions?

1) What is the maxmimum tempreture in new york in the month of january?

2) On which days did it rains?

3) What was the average speed of wind during the month?

In [0]:
import pandas as pd
dataset = pd.read_csv('nyc_weather.csv')
dataset.head(10)

          EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
0  01-01-2016           38        23  ...           5     NaN             281
1  01-02-2016           36        18  ...           3     NaN             275
2  01-03-2016           40        21  ...           1     NaN             277
3  01-04-2016           25         9  ...           3     NaN             345
4  01-05-2016           20        -3  ...           0     NaN             333
5  01-06-2016           33         4  ...           0     NaN             259
6  01-07-2016           39        11  ...           3     NaN             293
7  01-08-2016           39        29  ...           8     NaN              79
8  01-09-2016           44        38  ...           8    Rain              76
9  01-10-2016           50        46  ...           7    Rain             109

[10 rows x 11 columns]

In [0]:
dataset.describe()

       Temperature   DewPoint  ...  CloudCover  WindDirDegrees
count    31.000000  31.000000  ...   31.000000       31.000000
mean     34.677419  17.838710  ...    3.129032      247.129032
std       7.639315  11.378626  ...    2.629853       92.308086
min      20.000000  -3.000000  ...    0.000000       34.000000
25%      29.000000  10.000000  ...    1.000000      238.000000
50%      35.000000  18.000000  ...    3.000000      281.000000
75%      39.500000  23.000000  ...    4.500000      300.000000
max      50.000000  46.000000  ...    8.000000      345.000000

[8 rows x 8 columns]

In [0]:
# Get the maximum temparature

dataset['Temperature'].max()

50

In [0]:
# to know which day it rains

dataset['EST'][dataset['Events'] == 'Rain']

8     01-09-2016
9     01-10-2016
15     1/16/2016
26     1/27/2016
Name: EST, dtype: object

In [0]:
# Average wind speed

dataset['WindSpeedMPH'].mean()

6.892857142857143

**Read and Write CSV and XLS files**

In [0]:
df2 = pd.read_csv('Weather_data_fresh.csv')
df2.head(10)

          day  temperature  windspeed  event      city
0  01-01-2017           32          6   Rain    mumbai
1  02-01-2017           35          7  Sunny  New York
2   03-01-207           28          2   Snow  New York
3  04-01-2017           24          7   Snow  New York
4  05-01-2017           32          4   Rain    mumbai
5  06-01-2017           32          2  Sunny    mumbai
6  07-01-2017           28          6  Sunny    mumbai
7  08-01-2017           24          7   Rain    mumbai
8  09-01-2017           36          2   Snow     paris
9  10-01-2017           38          5  Sunny    mumbai

In [0]:
# Install pip3 install xlrd

# read excel file

df = pd.read_excel("Weather_data.xlsx")
df

                   day  temperature  windspeed  event
0  2017-01-01 00:00:00           32          6   Rain
1  2017-01-02 00:00:00           35          7  Sunny
2            03-01-207           28          2   Snow
3  2017-01-04 00:00:00           24          7   Snow
4  2017-01-05 00:00:00           32          4   Rain
5  2017-01-06 00:00:00           32          2  Sunny

In [0]:
# Write DF to csv

df.to_csv("new.csv")
df.to_csv('new_noindex.csv', index = False)

In [0]:
# pip Install openpyx
df.to_excel('new1.xlsx', sheet_name = 'weather_data1')

**Group-By**

In [0]:
import pandas as pd
df = pd.read_csv('Weather_data_city.csv')
df.head(10)

          day  temperature  windspeed  event      city
0  01-01-2017           32          6   Rain    mumbai
1  02-01-2017           35          7  Sunny  New York
2   03-01-207           28          2   Snow  New York
3  04-01-2017           24          7   Snow  New York
4  05-01-2017           32          4   Rain    mumbai
5  06-01-2017           32          2  Sunny    mumbai
6  07-01-2017           28          6  Sunny    mumbai
7  08-01-2017           24          7   Rain    mumbai
8  09-01-2017           36          2   Snow     paris
9  10-01-2017           38          5  Sunny    mumbai

In [0]:
g = df.groupby('city')
g

In [0]:
for city, city_df in g:
    print(city)
    print(city_df)

New York
           day  temperature  windspeed  event      city
1   02-01-2017           35          7  Sunny  New York
2    03-01-207           28          2   Snow  New York
3   04-01-2017           24          7   Snow  New York
10  11-01-2017           22          4   Rain  New York
14  15-01-2017           29          6   Rain  New York
17  18-01-2017           20          2   Snow  New York
18  19-01-2017           25          6  Sunny  New York
21  22-01-2017           32          5   Snow  New York
mumbai
           day  temperature  windspeed  event    city
0   01-01-2017           32          6   Rain  mumbai
4   05-01-2017           32          4   Rain  mumbai
5   06-01-2017           32          2  Sunny  mumbai
6   07-01-2017           28          6  Sunny  mumbai
7   08-01-2017           24          7   Rain  mumbai
9   10-01-2017           38          5  Sunny  mumbai
12  13-01-2017           24          8  Sunny  mumbai
15  16-01-2017           30          7   Snow  mumbai
19  20-01-2017           28          3   Rain  mumbai
22  23-01-2017           21          7   Rain  mumbai
paris
           day  temperature  windspeed  event   city
8   09-01-2017           36          2   Snow  paris
11  12-01-2017           26          2   Rain  paris
13  14-01-2017           25          3   Snow  paris
16  17-01-2017           31          5  Sunny  paris
20  21-01-2017           29          4  Sunny  paris
23  24-01-2017           27          5  Sunny  paris

In [0]:
#Get specific group
g.get_group('New York')

           day  temperature  windspeed  event      city
1   02-01-2017           35          7  Sunny  New York
2    03-01-207           28          2   Snow  New York
3   04-01-2017           24          7   Snow  New York
10  11-01-2017           22          4   Rain  New York
14  15-01-2017           29          6   Rain  New York
17  18-01-2017           20          2   Snow  New York
18  19-01-2017           25          6  Sunny  New York
21  22-01-2017           32          5   Snow  New York

In [0]:
#Get specific group
g.get_group('mumbai')

           day  temperature  windspeed  event    city
0   01-01-2017           32          6   Rain  mumbai
4   05-01-2017           32          4   Rain  mumbai
5   06-01-2017           32          2  Sunny  mumbai
6   07-01-2017           28          6  Sunny  mumbai
7   08-01-2017           24          7   Rain  mumbai
9   10-01-2017           38          5  Sunny  mumbai
12  13-01-2017           24          8  Sunny  mumbai
15  16-01-2017           30          7   Snow  mumbai
19  20-01-2017           28          3   Rain  mumbai
22  23-01-2017           21          7   Rain  mumbai

In [0]:
# Find maximum tempreture in each of the cities

print(g.max())

                 day  temperature  windspeed  event
city
New York  22-01-2017           35          7  Sunny
mumbai    23-01-2017           38          8  Sunny
paris     24-01-2017           36          5  Sunny

In [0]:
print(g.mean())

          temperature  windspeed
city
New York       26.875      4.875
mumbai         28.900      5.500
paris          29.000      3.500

In [0]:
print(g.describe())

         temperature                                 ... windspeed
               count    mean       std   min    25%  ...       min   25%  50%   75%  max
city                                                 ...
New York         8.0  26.875  5.083236  20.0  23.50  ...       2.0  3.50  5.5  6.25  7.0
mumbai          10.0  28.900  4.998889  21.0  25.00  ...       2.0  4.25  6.0  7.00  8.0
paris            6.0  29.000  4.049691  25.0  26.25  ...       2.0  2.25  3.5  4.75  5.0

[3 rows x 16 columns]

**Concatenate Data Frames**

In [0]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "tempreture": [32, 45, 30],
    "humidity": [80, 60, 78]
})

india_weather

       city  tempreture  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78

In [0]:
us_weather = pd.DataFrame({
    "city":["new york", "chicago", "orlando"],
    "tempreture":[21,14,35],
    "humidity":[68,65,75]
})
us_weather

       city  tempreture  humidity
0  new york          21        68
1   chicago          14        65
2   orlando          35        75

In [0]:
# Concate teo dataframe

df = pd.concat([india_weather,us_weather])
df

       city  tempreture  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78
0  new york          21        68
1   chicago          14        65
2   orlando          35        75

In [0]:
# if you want continous index

df = pd.concat([india_weather,us_weather], ignore_index = True)
df

       city  tempreture  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78
3  new york          21        68
4   chicago          14        65
5   orlando          35        75

In [0]:
df = pd.concat([india_weather,us_weather], axis=1)
df

       city  tempreture  humidity      city  tempreture  humidity
0    mumbai          32        80  new york          21        68
1     delhi          45        60   chicago          14        65
2  banglore          30        78   orlando          35        75

**Merge DataFrame**

In [0]:
tempreture_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore",'hydrabad'],
    "tempreture": [32, 45, 30,40],
})
tempreture_df

       city  tempreture
0    mumbai          32
1     delhi          45
2  banglore          30
3  hydrabad          40

In [0]:
humidity_df = pd.DataFrame({
    "city": [ "delhi","mumbai", "banglore"],
    "humidity": [65, 68, 75],
})
humidity_df

       city  humidity
0     delhi        65
1    mumbai        68
2  banglore        75

In [0]:
# merge two dataframe with out explicity mention index
df = pd.merge(tempreture_df,humidity_df, on='city')
df

       city  tempreture  humidity
0    mumbai          32        68
1     delhi          45        65
2  banglore          30        75

In [0]:
# outer-Join
df = pd.merge(tempreture_df,humidity_df, on='city', how='outer')
df

       city  tempreture  humidity
0    mumbai          32      68.0
1     delhi          45      65.0
2  banglore          30      75.0
3  hydrabad          40       NaN

**Numerical Indexing (.loc vs iloc)**

In [0]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index = [49,48,47,46,45,1,2,3,4,5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [0]:
df.loc[46] # find the value in index.

0    4
Name: 46, dtype: int64

In [0]:
df.iloc[:2]

    0
49  1
48  2

In [0]:
df.iloc[3]   # find the value in row.

0    4
Name: 46, dtype: int64

In [0]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [0]:
# df.iloc[45]  # Error because 45 rows not present in data frame

In [0]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

**Great Job!**